Onwrikbaar/NeoDK/firmware/src/bsp_stm32g071.c
/*
 *  bsp_stm32g071.c
 *
 *  NOTICE (do not remove):
 *      This file is part of project NeoDK (https://github.com/Onwrikbaar/NeoDK).
 *      See https://github.com/Onwrikbaar/NeoDK/blob/main/LICENSE.txt for full license details.
 *
 *  Created on: 20 Oct 2023
 *      Author: mark
 *   Copyright  2023..2025 Neostim™
 */

#include <limits.h>
#include <string.h>

#include "stm32g0xx_hal_rcc.h"
// #include "stm32g0xx_ll_rcc.h"
// #include "stm32g0xx_ll_pwr.h"
#include "stm32g0xx_hal_pwr.h"
#include "stm32g0xx_hal_pwr_ex.h"
#include "stm32g0xx_ll_system.h"
#include "stm32g0xx_ll_gpio.h"
#include "stm32g0xx_ll_exti.h"
#include "stm32g0xx_ll_tim.h"
#include "stm32g0xx_ll_dac.h"
#include "stm32g0xx_ll_adc.h"
#include "stm32g0xx_ll_dma.h"

#include "bsp_dbg.h"
#include "app_event.h"

// This module implements:
#include "bsp_mao.h"
#include "bsp_app.h"


#define ADC_GPIO_PORT           GPIOA
#define TRF_CURR_SENSE_PIN      LL_GPIO_PIN_0   // ADC_IN0.
#define CAP_VOLT_SENSE_PIN      LL_GPIO_PIN_1   // ADC_IN1.
#define BAT_VOLT_SENSE_PIN      LL_GPIO_PIN_6   // ADC_IN6.

#define DAC_GPIO_PORT           GPIOA
#define VCAP_BUCK_CTRL_PIN      LL_GPIO_PIN_5   // DAC1_OUT2.

#define USART_GPIO_PORT         GPIOA
#define USART2_TX_PIN           LL_GPIO_PIN_2
#define USART2_RX_PIN           LL_GPIO_PIN_3

#define PUSHBUTTON_PORT         GPIOA
#define PUSHBUTTON_PIN          LL_GPIO_PIN_4   // Digital in with pulldown.

#define MOSFET_GPIO_PORT        GPIOA
#define MOSFET_1_PIN            LL_GPIO_PIN_8   // Digital out, push-pull.
#define MOSFET_2_PIN            LL_GPIO_PIN_9   // Digital out, push-pull.

#define TRIAC_GPIO_PORT         GPIOB
#define TRIAC_1_PIN             LL_GPIO_PIN_0   // Digital out, open drain.
#define TRIAC_2_PIN             LL_GPIO_PIN_1   // Digital out, open drain.
#define TRIAC_3_PIN             LL_GPIO_PIN_2   // Digital out, open drain.
#define TRIAC_4_PIN             LL_GPIO_PIN_5   // Digital out, open drain.
#define TRIAC_5_PIN             LL_GPIO_PIN_7   // Digital out, open drain.
#define TRIAC_6_PIN             LL_GPIO_PIN_8   // Digital out, open drain.
#define ALL_TRIAC_PINS          (TRIAC_1_PIN | TRIAC_2_PIN | TRIAC_3_PIN | TRIAC_4_PIN)

#define BUCK_GPIO_PORT          GPIOB
#define BUCK_ENABLE_PIN         LL_GPIO_PIN_9   // Digital out, push-pull.

#define LED_GPIO_PORT           GPIOC
#define LED_1_PIN               LL_GPIO_PIN_6   // The on-board LED.


// #define ADC_TIMER_FREQ_Hz        100000UL
#define SEQUENCER_CLOCK_FREQ_Hz 1000000UL
#define PULSE_TIMER_FREQ_Hz     1000000UL
#define APP_TIMER_FREQ_Hz       2000000UL
#define TICKS_PER_MICROSECOND   (APP_TIMER_FREQ_Hz / 1000000UL)


typedef struct {
    // The following members get set only once.
    void (*app_timer_handler)(void *, uint64_t);
    void *app_timer_target;
    uint32_t clock_ticks_per_app_timer_tick;
    Selector button_sel;
    EventQueue *pulse_delegate;
    Selector rx_sel;
    Selector rx_err_sel;
    void (*tx_callback)(void *, uint8_t *);
    void *tx_target;
    Selector tx_err_sel;
    // The following members get updated regularly.
    uint8_t critical_section_level;
    uint8_t nr_of_serial_devices;
    uint16_t volatile adc_1_samples[3];         // Must match the number of ADC1 ranks.
    uint16_t V_prim_mV;
    uint16_t volatile pulse_seqnr;
    Burst burst;
    bool keep_load_connected;
    // Deltas deltas;
} BSP;

// The interrupt request priorities, from high to low.
enum {  // STM32G0xx MCUs have 4 interrupt priority levels.
    IRQ_PRIO_PULSE, IRQ_PRIO_SEQ_CLOCK = IRQ_PRIO_PULSE,
    IRQ_PRIO_ADC_DMA, IRQ_PRIO_SYSTICK = IRQ_PRIO_ADC_DMA,
    IRQ_PRIO_USART, IRQ_PRIO_APP_TIMER = IRQ_PRIO_USART,
    IRQ_PRIO_ADC1, IRQ_PRIO_EXTI = IRQ_PRIO_ADC1
};

// Ensure the following three consts refer to the same timer.
static TIM_TypeDef *const pulse_timer = TIM1;   // Advanced 16-bit timer.
static IRQn_Type const pulse_timer_upd_irq = TIM1_BRK_UP_TRG_COM_IRQn;
static IRQn_Type const pulse_timer_cc_irq  = TIM1_CC_IRQn;

// Ensure the following two consts refer to the same timer.
static TIM_TypeDef *const seq_clock  = TIM2;    // General purpose 32-bit timer.
static IRQn_Type const seq_clock_irq = TIM2_IRQn;

// Ensure the following two consts refer to the same timer.
static TIM_TypeDef *const app_timer  = TIM17;   // General purpose 16-bit timer.
static IRQn_Type const app_timer_irq = TIM17_IRQn;

static BSP bsp = {0};

// Using a couple of functions from STM's infamous HAL.
extern HAL_StatusTypeDef HAL_InitTick(uint32_t);
extern void HAL_IncTick(void);


static void SystemClock_Config(void)
{
    HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);
    PWR->CR1 |= PWR_CR1_DBP;
    while ((PWR->CR1 & PWR_CR1_DBP) == RESET) { /* Wait for write protection to be removed. */ }
    RCC->BDCR = RCC_BDCR_LSEON | RCC_BDCR_LSEDRV_0 | RCC_BDCR_RTCEN;
    while ((RCC->BDCR & RCC_BDCR_LSERDY) == RESET) { /* Wait for LSE to stabilise. */ }
    // TODO Calibrate HSI using LSE and TIM16?

    RCC_OscInitTypeDef RCC_OscInitStruct = {
        .OscillatorType = RCC_OSCILLATORTYPE_HSI,
        .HSIState = RCC_HSI_ON,
        .HSIDiv = RCC_HSI_DIV1,
        .HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT,
        .PLL.PLLState = RCC_PLL_ON,
        .PLL.PLLSource = RCC_PLLSOURCE_HSI,
        .PLL.PLLM = RCC_PLLM_DIV4,
        .PLL.PLLN = 48,
        .PLL.PLLP = RCC_PLLP_DIV12,             // For 16 MHz clock.
        .PLL.PLLQ = RCC_PLLQ_DIV4,              // For 48 MHz clock.
        .PLL.PLLR = RCC_PLLR_DIV3               // For 64 MHz clock.
    };
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    RCC_ClkInitTypeDef RCC_ClkInitStruct = {
        .ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1,
        .SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK,
        .AHBCLKDivider = LL_RCC_SYSCLK_DIV_1,
        .APB1CLKDivider = RCC_HCLK_DIV1
    };
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, LL_FLASH_LATENCY_2);

    PWR->CR1 &= ~PWR_CR1_DBP;
}


static void enableInterruptWithPrio(IRQn_Type intr, int prio)
{
    NVIC_ClearPendingIRQ(intr);
    NVIC_SetPriority(intr, prio);
    NVIC_EnableIRQ(intr);
}


static void spuriousIRQ(BSP *me)
{
    uint32_t const active_irq_nr = __get_IPSR();
    BSP_logf("%s(%u)\n", __func__, active_irq_nr);
    // TODO Disable the interrupt in question.
}


static void initGPIO()
{
    LL_GPIO_InitTypeDef GPIO_InitStruct = {0};

