Onwrikbaar/NeoDK/firmware/src/bsp_stm32g071.c
    GPIO_InitStruct.Mode = LL_GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = LL_GPIO_PULL_DOWN;
    GPIO_InitStruct.Pin  = PUSHBUTTON_PIN;
    LL_GPIO_Init(PUSHBUTTON_PORT, &GPIO_InitStruct);
    if (LL_GPIO_IsInputPinSet(PUSHBUTTON_PORT, GPIO_InitStruct.Pin)) {
        uint32_t const *const SYS_MEM = (uint32_t *)0x1FFF0000;
        __set_MSP(SYS_MEM[0]);                  // Set up the bootloader's stackpointer.
        void (*startBootLoader)(void) = (void (*)(void))SYS_MEM[1];
        startBootLoader();                      // This call does not return.
    }

    GPIO_InitStruct.Mode = LL_GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
    GPIO_InitStruct.Pin = TRF_CURR_SENSE_PIN | CAP_VOLT_SENSE_PIN | BAT_VOLT_SENSE_PIN;
    LL_GPIO_Init(ADC_GPIO_PORT, &GPIO_InitStruct);
    GPIO_InitStruct.Pin = VCAP_BUCK_CTRL_PIN;
    LL_GPIO_Init(DAC_GPIO_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;
    GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Pin = BUCK_ENABLE_PIN;
    LL_GPIO_ResetOutputPin(BUCK_GPIO_PORT, GPIO_InitStruct.Pin);
    LL_GPIO_Init(BUCK_GPIO_PORT, &GPIO_InitStruct);
    GPIO_InitStruct.Pin = LED_1_PIN;
    LL_GPIO_SetOutputPin(LED_GPIO_PORT, GPIO_InitStruct.Pin);
    LL_GPIO_Init(LED_GPIO_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_OPENDRAIN;
    GPIO_InitStruct.Pin = ALL_TRIAC_PINS;
    LL_GPIO_SetOutputPin(TRIAC_GPIO_PORT, GPIO_InitStruct.Pin);
    LL_GPIO_Init(TRIAC_GPIO_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStruct.Alternate = LL_GPIO_AF_2;   // TIM1_CH1 and TIM1_CH2.
    GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Pin = MOSFET_1_PIN | MOSFET_2_PIN;
    LL_GPIO_ResetOutputPin(MOSFET_GPIO_PORT, GPIO_InitStruct.Pin);
    LL_GPIO_Init(MOSFET_GPIO_PORT, &GPIO_InitStruct);

    // GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStruct.Alternate = LL_GPIO_AF_1;
    GPIO_InitStruct.Pin = USART2_TX_PIN | USART2_RX_PIN;
    LL_GPIO_Init(USART_GPIO_PORT, &GPIO_InitStruct);
}


static void initEXTI()
{
    LL_EXTI_InitTypeDef EXTI_InitStruct = {
        .Line_0_31 = LL_EXTI_LINE_4,
        .LineCommand = ENABLE,
        .Mode = LL_EXTI_MODE_IT,
        .Trigger = LL_EXTI_TRIGGER_RISING_FALLING
    };
    LL_EXTI_Init(&EXTI_InitStruct);
    enableInterruptWithPrio(EXTI4_15_IRQn, IRQ_PRIO_EXTI);
}


static void initAppTimer()
{
    app_timer->PSC = SystemCoreClock / APP_TIMER_FREQ_Hz - 1;
    app_timer->CCR1 = BSP_millisecondsToTicks(100);
    app_timer->DIER |= TIM_DIER_CC1IE;          // Interrupt on match with compare register.
    app_timer->EGR |= TIM_EGR_UG;               // Force update of the shadow registers.
    app_timer->CR1 = TIM_CR1_CEN;               // Enable the counter.
    enableInterruptWithPrio(app_timer_irq, IRQ_PRIO_APP_TIMER);
}


static void initSequencerClock()
{
    seq_clock->PSC = SystemCoreClock / SEQUENCER_CLOCK_FREQ_Hz - 1;
    // BSP_logf("%s: PSC=%u\n", __func__, seq_clock->PSC);
    seq_clock->CCMR1 |= TIM_CCMR1_OC1M_0;
    seq_clock->DIER |= TIM_DIER_CC1IE;          // Interrupt on match with compare register.
    seq_clock->EGR |= TIM_EGR_UG;               // Force update of the shadow registers.
    enableInterruptWithPrio(seq_clock_irq, IRQ_PRIO_SEQ_CLOCK);
}


static void initPulseTimer()
{
    pulse_timer->PSC = SystemCoreClock / PULSE_TIMER_FREQ_Hz - 1;
    // BSP_logf("%s: PSC=%u\n", __func__, pulse_timer->PSC);
    // PWM mode 1 for timer channels 1 and 2, enable preload.
    pulse_timer->CCMR1 = TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1 | TIM_CCMR1_OC1PE
                       | TIM_CCMR1_OC2M_2 | TIM_CCMR1_OC2M_1 | TIM_CCMR1_OC2PE;
    // Enable both outputs.
    pulse_timer->CCER = TIM_CCER_CC1E | TIM_CCER_CC2E;
    pulse_timer->CR2  = TIM_CR2_CCPC;           // Compare control signals are preloaded.
    pulse_timer->CR1  = TIM_CR1_ARPE | TIM_CR1_URS;
    pulse_timer->DIER = TIM_DIER_UIE;           // Enable update interrupt.
    pulse_timer->BDTR = TIM_BDTR_OSSR | TIM_BDTR_MOE;
    enableInterruptWithPrio(pulse_timer_upd_irq, IRQ_PRIO_PULSE);
    enableInterruptWithPrio(pulse_timer_cc_irq,  IRQ_PRIO_PULSE);
}


static void initDAC()
{
    LL_DAC_InitTypeDef DAC_InitStruct = {
        .TriggerSource = LL_DAC_TRIG_SOFTWARE,
        .WaveAutoGeneration = LL_DAC_WAVE_AUTO_GENERATION_NONE,
        .OutputBuffer = LL_DAC_OUTPUT_BUFFER_ENABLE,
        .OutputConnection = LL_DAC_OUTPUT_CONNECT_GPIO,
        .OutputMode = LL_DAC_OUTPUT_MODE_NORMAL
    };
    LL_DAC_Init(DAC1, LL_DAC_CHANNEL_2, &DAC_InitStruct);
    // TODO Wait for the DAC to settle?
    LL_DAC_Enable(DAC1, LL_DAC_CHANNEL_2);
    // LL_DAC_EnableTrigger(DAC1, LL_DAC_CHANNEL_2);
}


static void initADC1()
{
    // BSP_logf("%s\n", __func__);
    LL_ADC_InitTypeDef gis = {
        // .Clock = LL_ADC_CLOCK_SYNC_PCLK_DIV4,
        .Resolution    = LL_ADC_RESOLUTION_12B,
        .DataAlignment = LL_ADC_DATA_ALIGN_RIGHT,
        .LowPowerMode  = LL_ADC_LP_MODE_NONE,
    };
    LL_ADC_Init(ADC1, &gis);
    LL_ADC_REG_SetSequencerConfigurable(ADC1, LL_ADC_REG_SEQ_CONFIGURABLE);
    while (LL_ADC_IsActiveFlag_CCRDY(ADC1) == 0) { /* Wait. */ }
    LL_ADC_ClearFlag_CCRDY(ADC1);

    LL_ADC_SetSamplingTimeCommonChannels(ADC1, LL_ADC_SAMPLINGTIME_COMMON_1, LL_ADC_SAMPLINGTIME_7CYCLES_5);
    LL_ADC_SetSamplingTimeCommonChannels(ADC1, LL_ADC_SAMPLINGTIME_COMMON_2, LL_ADC_SAMPLINGTIME_39CYCLES_5);

    // Configure a regular channel for the transformer's primary current sensing.
    LL_ADC_REG_SetSequencerRanks(ADC1, LL_ADC_REG_RANK_1, LL_ADC_CHANNEL_0);
    LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_0, LL_ADC_SAMPLINGTIME_COMMON_1);
    // Configure a regular channel for the capacitor voltage VCAP.
    LL_ADC_REG_SetSequencerRanks(ADC1, LL_ADC_REG_RANK_2, LL_ADC_CHANNEL_1);
    LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_1, LL_ADC_SAMPLINGTIME_COMMON_2);
    // Configure a regular channel for the battery/supply voltage.
    LL_ADC_REG_SetSequencerRanks(ADC1, LL_ADC_REG_RANK_3, LL_ADC_CHANNEL_6);
    LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_6, LL_ADC_SAMPLINGTIME_COMMON_2);

