Onwrikbaar/NeoDK/firmware/src/bsp_stm32g071.c
    LL_ADC_EnableInternalRegulator(ADC1);
    uint32_t volatile wli = LL_ADC_DELAY_INTERNAL_REGUL_STAB_US * (SystemCoreClock / 1000000);
    while (wli != 0) wli--;

    LL_ADC_StartCalibration(ADC1);
    while (LL_ADC_IsCalibrationOnGoing(ADC1)) { /* Wait. */ }
    ADC1->ISR = ADC_ISR_EOCAL;
    wli = LL_ADC_DELAY_CALIB_ENABLE_ADC_CYCLES * 16;
    while (wli != 0) wli--;

    // ADC->CCR |= ADC_CCR_VREFEN | ADC_CCR_TSEN;
    ADC1->CFGR2 |= ADC_CFGR2_LFTRIG;
    ADC1->IER = ADC_IER_ADRDYIE | ADC_IER_OVRIE;
    enableInterruptWithPrio(ADC1_COMP_IRQn, IRQ_PRIO_ADC1);

    LL_ADC_REG_InitTypeDef ris = {
        .SequencerLength  = LL_ADC_REG_SEQ_SCAN_ENABLE_3RANKS,
        .SequencerDiscont = LL_ADC_REG_SEQ_DISCONT_DISABLE,
        .ContinuousMode   = LL_ADC_REG_CONV_SINGLE,
        // .TriggerSource    = LL_ADC_REG_TRIG_EXT_TIM3_TRGO,
        .DMATransfer      = LL_ADC_REG_DMA_TRANSFER_UNLIMITED,
        .Overrun          = LL_ADC_REG_OVR_DATA_OVERWRITTEN,
    };
    ErrorStatus es = LL_ADC_REG_Init(ADC1, &ris);
    if (es != SUCCESS) {
        BSP_logf("LL_ADC_REG_Init error=%u\n", es);
    }
    LL_ADC_SetOverSamplingScope(ADC1, LL_ADC_OVS_DISABLE);
    LL_ADC_SetTriggerFrequencyMode(ADC1, LL_ADC_CLOCK_FREQ_MODE_HIGH);
}


static void initDMAforADC1(uint16_t volatile samples[], size_t nr_of_samples)
{
    LL_DMA_SetPeriphRequest(DMA1, LL_DMA_CHANNEL_1, LL_DMAMUX_REQ_ADC1);
    LL_DMA_ConfigTransfer(DMA1, LL_DMA_CHANNEL_1, LL_DMA_DIRECTION_PERIPH_TO_MEMORY | LL_DMA_MODE_CIRCULAR
                              | LL_DMA_PERIPH_NOINCREMENT | LL_DMA_MEMORY_INCREMENT
                              | LL_DMA_PDATAALIGN_HALFWORD | LL_DMA_MDATAALIGN_HALFWORD
                              | LL_DMA_PRIORITY_HIGH);
    LL_DMA_ConfigAddresses(DMA1, LL_DMA_CHANNEL_1, LL_ADC_DMA_GetRegAddr(ADC1, LL_ADC_DMA_REG_REGULAR_DATA),
                            (uint32_t)samples, LL_DMA_DIRECTION_PERIPH_TO_MEMORY);
    LL_DMA_SetDataLength(DMA1, LL_DMA_CHANNEL_1, nr_of_samples);
    DMA1->IFCR = DMA_IFCR_CGIF1;                // Clear all channel 1 interrupt flags.
    LL_DMA_EnableIT_TC(DMA1, LL_DMA_CHANNEL_1); // Enable transfer complete interrupt.
    LL_DMA_EnableIT_TE(DMA1, LL_DMA_CHANNEL_1); // Enable transfer error interrupt.
    LL_DMA_EnableChannel(DMA1, LL_DMA_CHANNEL_1);
    enableInterruptWithPrio(DMA1_Channel1_IRQn, IRQ_PRIO_ADC_DMA);
}


static void initUSART2(uint32_t serial_speed_bps)
{
    RCC->CCIPR |= LL_RCC_USART2_CLKSOURCE_HSI;
    USART2->BRR = (uint16_t)((HSI_VALUE + serial_speed_bps / 2) / serial_speed_bps);
    USART2->CR1 |= USART_CR1_UE | USART_CR1_FIFOEN;
}


static void setPinVal(GPIO_TypeDef *GPIOx, uint16_t gpio_pin, uint8_t pin_state)
{
    if (pin_state != 0) {
        LL_GPIO_SetOutputPin(GPIOx, gpio_pin);
    } else {
        LL_GPIO_ResetOutputPin(GPIOx, gpio_pin);
    }
}


static void setSwitches(uint16_t pattern)
{
    // Turn on the LED if at least one triac will be activated.
    setPinVal(LED_GPIO_PORT, LED_1_PIN, pattern);

    // The triac enable signals are active low.
    TRIAC_GPIO_PORT->BSRR
        = (pattern & 1 ? TRIAC_1_PIN << 16 : TRIAC_1_PIN)
        | (pattern & 2 ? TRIAC_2_PIN << 16 : TRIAC_2_PIN)
        | (pattern & 4 ? TRIAC_3_PIN << 16 : TRIAC_3_PIN)
        | (pattern & 8 ? TRIAC_4_PIN << 16 : TRIAC_4_PIN);
}


static void disableOutputStage()
{
    pulse_timer->CCER &= ~(TIM_CCER_CC1E | TIM_CCER_CC2E);
    LL_GPIO_ResetOutputPin(BUCK_GPIO_PORT, BUCK_ENABLE_PIN);
    LL_GPIO_SetOutputPin(TRIAC_GPIO_PORT, ALL_TRIAC_PINS);
}


static uint64_t ticksSinceBoot()
{
    static uint16_t ticks_since_boot[] = { 0, 0, 0, 0 };

    BSP_criticalSectionEnter();                 // Protect our static var.
    uint16_t last_ticks = ticks_since_boot[0];  // Assuming little-Endian.
    if ((ticks_since_boot[0] = app_timer->CNT) < last_ticks) {
        // The 16-bit timer wrapped; increment the second 16-bit word.
        if (++ticks_since_boot[1] == 0) {       // We have a 32-bit wrap too.
            *(uint32_t *)&ticks_since_boot[2] += 1;
        }
    }
    BSP_criticalSectionExit();
    return *(uint64_t *)ticks_since_boot;
}

/**
 * @brief   Calculate the value (0..4095) for the 12-bit DAC to set the desired primary voltage [mV].
 * @note    Assuming R15 = 115 kΩ, R18 = 13 kΩ and R19 = 42.2 kΩ (Refer to the schematic).
 */
#define VPRIM_MIN_mV     1202   //  1202 for Tokmas buck chip, 1064 for SGM 61410.
#define VPRIM_MAX_mV    10195   // 10195 for Tokmas, 10057 for SGM.

static uint16_t Vcap_mV_ToDacVal(uint16_t Vcap_mV)
{
    if (Vcap_mV < VPRIM_MIN_mV) Vcap_mV = VPRIM_MIN_mV;
    else if (Vcap_mV > VPRIM_MAX_mV) Vcap_mV = VPRIM_MAX_mV;
    return (uint16_t)(((1865 * (uint32_t)(VPRIM_MAX_mV - Vcap_mV)) + 2048) / 4096);
}


static void setPrimaryVoltage(BSP *me)
{
    if (me->burst.amplitude != 0) {             // 0 means do not change.
        // Scale amplitude 0..255 to 0..8160 mV (for now).
        BSP_setPrimaryVoltage_mV(me->burst.amplitude * 32);
    }
}


static void kickOffBurst(BSP *me)
{
    setPrimaryVoltage(me);
    Burst *burst = &me->burst;
    if (Burst_pulseWidth_µs(burst) == 0) {
        setSwitches(burst->elcon[0] | burst->elcon[1]);
    } else {
        me->pulse_seqnr = 0;
        me->keep_load_connected = Burst_keepLoadConnected(burst);
        BSP_startBurst(Burst_adjust(burst));
    }
}


static void doUartAction(USART_TypeDef *uart, ChannelAction action)
{
    switch (action)
    {
        case CA_RX_CB_ENABLE:
            uart->CR1 |= USART_CR1_RXNEIE_RXFNEIE;
            break;
        case CA_RX_CB_DISABLE:
            uart->CR1 &= ~USART_CR1_RXNEIE_RXFNEIE;
            break;
        case CA_TX_CB_ENABLE:
            uart->CR1 |= USART_CR1_TXEIE_TXFNFIE;
            break;
        case CA_TX_CB_DISABLE:
            uart->CR1 &= ~USART_CR1_TXEIE_TXFNFIE;
            break;
        case CA_OVERRUN_CB_ENABLE:
            break;
        case CA_OVERRUN_CB_DISABLE:
            break;
        case CA_FRAMING_CB_ENABLE:
            break;
        case CA_FRAMING_CB_DISABLE:
            break;
        case CA_CLEAR_ERRORS:
            uart->ICR = USART_ICR_ORECF | USART_ICR_PECF | USART_ICR_NECF | USART_ICR_UDRCF;
            break;
        case CA_CLOSE:
            // TODO Deinit the UART?
            break;
        default:
            BSP_logf("%s(%u): unknown UART action\n", __func__, action);
    }
}

