Onwrikbaar/NeoDK/firmware/src/bsp_stm32g071.c
/*
 * Following are the interrupt service routines.
 */

void HardFault_Handler(void)
{
    static volatile bool stay_here;

    disableOutputStage();
    BSP_logf("%s, ICSR=0x%x\n", __func__, SCB->ICSR);
    stay_here = true;
    BSP_logf("  Tip: halt CPU, change guard @ %p to 0, then step.\n", &stay_here);
    while (stay_here) {}
}

// Needed for HAL_Delay() to work.
void SysTick_Handler(void)
{
    HAL_IncTick();
}


void RCC_IRQHandler(void)
{
    // TODO Catch LSE ready interrupt?
    spuriousIRQ(&bsp);
}


void TIM1_BRK_UP_TRG_COM_IRQHandler(void)
{
    if (pulse_timer->SR & TIM_SR_UIF) {         // An update event.
        pulse_timer->CR1 &= ~TIM_CR1_CEN;       // Stop the counter.
        pulse_timer->DIER &= ~(TIM_DIER_CC1IE | TIM_DIER_CC2IE);
        pulse_timer->SR &= ~(TIM_SR_UIF | TIM_SR_CC1IF | TIM_SR_CC2IF);
        LL_GPIO_ResetOutputPin(LED_GPIO_PORT, LED_1_PIN);
        // BSP_logf("%s at %u µs\n", __func__, seq_clock->CNT);
        EventQueue_postEvent(bsp.pulse_delegate, ET_BURST_EXPIRED, NULL, 0);
    } else {
        BSP_logf("Pt SR=0x%x\n", __func__, pulse_timer->SR);
        // spuriousIRQ(&bsp);
    }
}


void TIM1_CC_IRQHandler(void)
{
    if ((pulse_timer->DIER & TIM_DIER_CC1IE) && (pulse_timer->SR & TIM_SR_CC1IF)) {
        pulse_timer->SR &= ~TIM_SR_CC1IF;
        bsp.pulse_seqnr += 1;
        // Burst_applyDeltas(&bsp.burst, &bsp.deltas);
    }
    if ((pulse_timer->DIER & TIM_DIER_CC2IE) && (pulse_timer->SR & TIM_SR_CC2IF)) {
        pulse_timer->SR &= ~TIM_SR_CC2IF;
        bsp.pulse_seqnr += 1;
        // Burst_applyDeltas(&bsp.burst, &bsp.deltas);
    }
    if (bsp.pulse_seqnr == pulse_timer->RCR + 1) {
        if (! bsp.keep_load_connected) {
            // Disconnect the output stage from the electrodes by turning all triacs off.
            LL_GPIO_SetOutputPin(TRIAC_GPIO_PORT, ALL_TRIAC_PINS);
        }
        // EventQueue_postEvent(bsp.pulse_delegate, ET_BURST_COMPLETED, (uint8_t const *)&seq_clock->CNT, sizeof seq_clock->CNT);
    }
    if (pulse_timer->SR & 0xcffe0) {
        BSP_logf("Pt SR=0x%x\n", pulse_timer->SR & 0xcffe0);
        spuriousIRQ(&bsp);
    }
}


void TIM2_IRQHandler(void)
{
    if (seq_clock->SR & TIM_SR_CC1IF) {
        // Briefly turn on all triacs to mitigate any 50 Hz interference.
        LL_GPIO_ResetOutputPin(TRIAC_GPIO_PORT, ALL_TRIAC_PINS);
        seq_clock->SR &= ~TIM_SR_CC1IF;         // Clear the interrupt.
        // BSP_logf("T2 at %u µs\n", seq_clock->CNT);
        kickOffBurst(&bsp);
    } else {
        spuriousIRQ(&bsp);
    }
}


void TIM17_IRQHandler(void)
{
    if (app_timer->SR & TIM_SR_CC1IF) {         // Capture/compare 1.
        app_timer->SR &= ~TIM_SR_CC1IF;         // Clear the interrupt.
        bsp.app_timer_handler(bsp.app_timer_target, BSP_microsecondsSinceBoot());
        app_timer->CCR1 += bsp.clock_ticks_per_app_timer_tick;
        return;
    }
    if (app_timer->SR & TIM_SR_UIF) {
        app_timer->SR &= ~TIM_SR_UIF;           // Clear the interrupt.
        // TODO ?
    } else {
        spuriousIRQ(&bsp);
    }
}


void EXTI4_15_IRQHandler(void)
{
    if (EXTI->RPR1 & PUSHBUTTON_PIN) {          // Rising?
        EXTI->RPR1 = PUSHBUTTON_PIN;
        invokeSelector(&bsp.button_sel, 1);
    } else if (EXTI->FPR1 & PUSHBUTTON_PIN) {   // Falling?
        EXTI->FPR1 = PUSHBUTTON_PIN;
        invokeSelector(&bsp.button_sel, 0);
    } else {
        spuriousIRQ(&bsp);
    }
}


void TIM6_DAC_LPTIM1_IRQHandler(void)
{
    // TODO Check for DAC interrupt.
    spuriousIRQ(&bsp);
}


void ADC1_COMP_IRQHandler(void)
{
    if (ADC1->ISR & ADC_ISR_OVR) {              // Overrun?
        ADC1->ISR = ADC_ISR_OVR;                // Clear.
        BSP_logf("ADC overrun\n");
    } else if (ADC1->ISR & ADC_ISR_ADRDY) {
        ADC1->ISR = ADC_ISR_ADRDY;              // Clear.
        BSP_logf("ADC ready\n");
    } else if (ADC1->ISR & ADC_ISR_CCRDY) {
        ADC1->ISR = ADC_ISR_CCRDY;              // Clear.
        BSP_logf("ADC channel config ready\n");
    } else if (ADC1->ISR & ADC_ISR_EOC) {       // Debugging only.
        ADC1->ISR = ADC_ISR_EOC;                // Clear.
        BSP_logf("ADC EOC\n");
    } else if (ADC1->ISR & ADC_ISR_EOS) {       // Debugging only.
        ADC1->ISR = ADC_ISR_EOS;                // Clear.
        BSP_logf("ADC EOS\n");
    } else {
        BSP_logf("ADC1->ISR=0x%x\n", ADC1->ISR);
        spuriousIRQ(&bsp);
    }
}


void DMA1_Channel1_IRQHandler(void)
{
    if (DMA1->ISR & DMA_ISR_TCIF1) {
        DMA1->IFCR = DMA_IFCR_CTCIF1;           // Clear transfer complete flag.
        EventQueue_postEvent(bsp.pulse_delegate, ET_ADC_DATA_AVAILABLE, (uint8_t const *)bsp.adc_1_samples, sizeof bsp.adc_1_samples);
    } else if (DMA1->ISR & DMA_ISR_TEIF1) {
        DMA1->IFCR = DMA_IFCR_CTEIF1;           // Clear transfer error flag.
        BSP_logf("%s, TEIF1\n", __func__);
        LL_DMA_EnableChannel(DMA1, LL_DMA_CHANNEL_1);
    } else {
        BSP_logf("%s, ISR=0x%x\n", __func__, DMA1->ISR);
        DMA1->IFCR = DMA_IFCR_CHTIF1;
    }
}


void USART2_IRQHandler(void)
{
    if (USART2->ISR & USART_ISR_RXNE_RXFNE) {
        invokeSelector(&bsp.rx_sel, USART2->RDR);
    } else if (USART2->ISR & USART_ISR_TXE_TXFNF) {
        if (USART2->CR1 & USART_CR1_TXEIE_TXFNFIE) {
            bsp.tx_callback(bsp.tx_target, (uint8_t *)&USART2->TDR);
        }
    } else {
        spuriousIRQ(&bsp);
    }
}

/*
 * Support for STM32Cube LL drivers.
 */

void assert_failed(uint8_t *filename, uint32_t line_nr)
{
    disableOutputStage();
    BSP_logf("%s(%s, %u)\n", __func__, filename, line_nr);
    // TODO Register the problem and then reboot.
    while (1) { /* Stay here */ }
}

/*
 * Below are the functions implementing this module's interface.
 */

void BSP_init()
{
    RCC->IOPENR = RCC_IOPENR_GPIOAEN | RCC_IOPENR_GPIOBEN | RCC_IOPENR_GPIOCEN;
    initGPIO();

    LL_RCC_SetADCClockSource(LL_RCC_ADC_CLKSOURCE_HSI);
    RCC->APBENR1 = RCC_APBENR1_TIM2EN | RCC_APBENR1_TIM3EN | RCC_APBENR1_USART2EN | RCC_APBENR1_PWREN | RCC_APBENR1_DAC1EN;
    RCC->APBENR2 = RCC_APBENR2_TIM1EN | RCC_APBENR2_TIM16EN | RCC_APBENR2_TIM17EN | RCC_APBENR2_ADCEN | RCC_APBENR2_SYSCFGEN;
    RCC->AHBENR |= RCC_AHBENR_DMA1EN;
    // Enable instruction cache and prefetch buffer.
    FLASH->ACR |= FLASH_ACR_ICEN | FLASH_ACR_PRFTEN;

    HAL_InitTick(IRQ_PRIO_SYSTICK);
    SystemClock_Config();
    BSP_logf("DevId=0x%x, SystemCoreClock=%u\n", LL_DBGMCU_GetDeviceID(), SystemCoreClock);
    initDAC();
    initDMAforADC1(bsp.adc_1_samples, M_DIM(bsp.adc_1_samples));
    initADC1();
    LL_ADC_Enable(ADC1);

    bsp.nr_of_serial_devices = 1;               // Device 0 is the SEGGER console.
}


char const *BSP_firmwareVersion()
{
    return "v0.56-beta";
}


void BSP_initComms(void)
{
    initUSART2(115200UL);
}


