Onwrikbaar/NeoDK/firmware/src/bsp_stm32g071.c
void BSP_criticalSectionEnter()
{
    __disable_irq();
    __DSB();
    __ISB();
    M_ASSERT(bsp.critical_section_level != UCHAR_MAX);
    bsp.critical_section_level += 1;
}


void BSP_criticalSectionExit()
{
    M_ASSERT(bsp.critical_section_level != 0);
    if (--bsp.critical_section_level == 0) {
        __DSB();
        __ISB();
        __enable_irq();
    }
}


uint32_t BSP_millisecondsToTicks(uint16_t ms)
{
    uint32_t const ticks_per_millisecond = APP_TIMER_FREQ_Hz / 1000UL;
    return (uint32_t)ms * ticks_per_millisecond;
}


uint64_t BSP_ticksToMicroseconds(uint64_t ticks)
{
    return ticks / TICKS_PER_MICROSECOND;
}


uint64_t BSP_microsecondsSinceBoot()
{
    return BSP_ticksToMicroseconds(ticksSinceBoot());
}


void BSP_registerAppTimerHandler(void (*handler)(void *, uint64_t), void *target, uint32_t microseconds_per_app_timer_tick)
{
    BSP_logf("%s\n", __func__);
    bsp.app_timer_handler = handler;
    bsp.app_timer_target  = target;
    bsp.clock_ticks_per_app_timer_tick = microseconds_per_app_timer_tick * TICKS_PER_MICROSECOND;
    initAppTimer();
}


void BSP_registerPulseDelegate(EventQueue *pdq)
{
    bsp.pulse_delegate = pdq;
    initPulseTimer();
    initSequencerClock();
}


void BSP_registerButtonHandler(Selector *sel)
{
    bsp.button_sel = *sel;
    initEXTI();
}


void BSP_toggleTheLED()
{
    LL_GPIO_TogglePin(LED_GPIO_PORT, LED_1_PIN);
}


DeviceId BSP_openSerialPort(char const *name)
{
    if (bsp.nr_of_serial_devices > 1) {
        BSP_logf("Can only use one serial port at a time, for now\n");
        return -1;
    }

    enableInterruptWithPrio(USART2_IRQn, IRQ_PRIO_USART);
    return bsp.nr_of_serial_devices++;
}


void BSP_registerRxCallback(DeviceId device_id, Selector const *rx_sel, Selector const *rx_err_sel)
{
    M_ASSERT(rx_sel != NULL && rx_err_sel != NULL);
    if (device_id == 1) {
        bsp.rx_sel = *rx_sel;
        bsp.rx_err_sel = *rx_err_sel;
        USART2->CR1 |= USART_CR1_RE;            // Enable the receiver.
    }
}


void BSP_registerTxCallback(DeviceId device_id, void (*cb)(void *, uint8_t *), void *target, Selector const *tx_err_sel)
{
    M_ASSERT(cb != NULL && target != NULL);
    if (device_id == 1) {
        bsp.tx_target = target;
        bsp.tx_callback = cb;
        bsp.tx_err_sel = *tx_err_sel;
        USART2->CR1 |= USART_CR1_TE;            // Enable the transmitter.
    }
}


void BSP_doChannelAction(DeviceId device_id, ChannelAction action)
{
    // BSP_logf("%s(%u, %u)\n", __func__, device_id, action);
    switch (device_id)
    {
        case 1:
            doUartAction(USART2, action);
            break;
        default:
            BSP_logf("%s(%u): unknown device id\n", __func__, device_id);
    }
}


int BSP_closeSerialPort(int device_id)
{
    M_ASSERT(device_id == bsp.nr_of_serial_devices - 1);
    // TODO De-initialise USART2?
    NVIC_DisableIRQ(USART2_IRQn);
    return 0;
}


void BSP_primaryVoltageEnable(bool must_be_on)
{
    if ((BUCK_GPIO_PORT->ODR & BUCK_ENABLE_PIN) == 0) {
        if (must_be_on) {
            BSP_logf("Turning Vcap ON\n");
            LL_GPIO_SetOutputPin(BUCK_GPIO_PORT, BUCK_ENABLE_PIN);
        }
    } else {
        if (! must_be_on) {
            BSP_logf("Turning Vcap OFF\n");
            LL_GPIO_ResetOutputPin(BUCK_GPIO_PORT, BUCK_ENABLE_PIN);
        }
    }
}


uint16_t BSP_setPrimaryVoltage_mV(uint16_t V_prim_mV)
{
    bsp.V_prim_mV = V_prim_mV;
    // TODO Ensure a rising step on the buck regulator's feedback pin does not exceed 80 mV.
    DAC1->DHR12R2 = Vcap_mV_ToDacVal(bsp.V_prim_mV);
    return bsp.V_prim_mV;
}


void BSP_startSequencerClock(uint32_t time_µs)
{
    BSP_logf("%s(%d)\n", __func__, time_µs);
    seq_clock->CCR1 = time_µs - 1;
    seq_clock->CNT = time_µs;
    seq_clock->CR1 |= TIM_CR1_CEN;              // Enable the counter.
}


void BSP_stopSequencerClock()
{
    BSP_logf("%s at %u µs\n", __func__, seq_clock->CNT);
    seq_clock->CR1 &= ~TIM_CR1_CEN;             // Disable the counter.
}


void BSP_resumeSequencerClock()
{
    BSP_logf("%s at %u µs\n", __func__, seq_clock->CNT);
    seq_clock->CR1 |= TIM_CR1_CEN;              // Enable the counter.
}


bool BSP_scheduleBurst(Burst const *burst)
{
    bsp.burst = *burst;
    seq_clock->CCR1 = bsp.burst.start_time_µs;
    // BSP_logf("SB(%hhu) d=%d µs\n", bsp.burst.phase, bsp.burst.start_time_µs - seq_clock->CNT);
    uint32_t cnt = seq_clock->CNT;
    if (cnt > seq_clock->CCR1 && seq_clock->CCR1 != 0) {
        BSP_logf("%s CNT = %u CCR1 = %u\n", __func__, seq_clock->CNT, seq_clock->CCR1);
        M_ASSERT(seq_clock->CNT < seq_clock->CCR1);
    }
    return true;
}


bool BSP_startBurst(Burst const *burst)
{
    pulse_timer->ARR = burst->pace_µs - 1;
    pulse_timer->RCR = burst->nr_of_pulses - 1;
    pulse_timer->CNT = 0;
    pulse_timer->SR &= ~(TIM_SR_CC1IF | TIM_SR_CC2IF);
    if (burst->phase == 0) {
        pulse_timer->CCR1 = Burst_pulseWidth_µs(burst);
        pulse_timer->DIER |= TIM_DIER_CC1IE;
    } else if (burst->phase == 1) {
        pulse_timer->CCR2 = Burst_pulseWidth_µs(burst);
        pulse_timer->DIER |= TIM_DIER_CC2IE;
    } else return false;                        // We only have one output stage.

    setSwitches(burst->elcon[0] | burst->elcon[1]);
    pulse_timer->EGR |= TIM_EGR_UG;             // Force update of the shadow registers.
    EventQueue_postEvent(bsp.pulse_delegate, ET_BURST_STARTED, (uint8_t const *)&seq_clock->CNT, sizeof seq_clock->CNT);
    pulse_timer->CCR1 = 0;
    pulse_timer->CCR2 = 0;
    pulse_timer->CR1 |= TIM_CR1_CEN;            // Enable the counter.
    return true;
}


void BSP_triggerADC(void)
{
    BSP_logf("%s\n", __func__);
    LL_ADC_REG_StartConversion(ADC1);
}


void BSP_close()
{
    __disable_irq();
}


void BSP_sleepMCU()
{
    HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI);
}


void BSP_assertionFailed(char const *filename, unsigned int line_number, char const *predicate)
{
    disableOutputStage();
    BSP_logf("ASSERTION FAILED (%s : %u) %s\n", filename, line_number, predicate);
    while (1) { /* Stay here. */ }
}


void BSP_shutDown()
{
    disableOutputStage();
    // HAL_Delay(1000);
    LL_GPIO_ResetOutputPin(LED_GPIO_PORT, LED_1_PIN);
    // HAL_PWREx_EnterSHUTDOWNMode();
    while (1) {}                                // Not reached.
}
